Каркасная_база_для_ЕДТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <tabularSections>
    <name>ПраваДоступа</name>
    <attributes>
      <name>Включена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Каркасная_база_для_ЕДТ/src/Catalogs/Пользователи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Проверяем, заполнена ли таблица прав доступа?
	СписокРолей = Метаданные.Роли;
	Если Объект.ПраваДоступа.Количество() <> СписокРолей.Количество() Тогда
		Объект.ПраваДоступа.Очистить();
		Для Каждого Роль Из СписокРолей Цикл
			НоваяСтрока = Объект.ПраваДоступа.Добавить();
			НоваяСтрока.Роль = Роль.Синоним;
			НоваяСтрока.ИмяРоли = Роль.Имя;
		КонецЦикла;
	КонецЕсли;
	
	//Включаем уже включенные роли у пользователя	
	ТекущийПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Наименование);
	Для каждого РольПользователя Из ТекущийПользователь.Роли Цикл
		СтруктураОтбора = Новый Структура("ИмяРоли", РольПользователя.Имя);
		РольВСписке = Объект.ПраваДоступа.НайтиСтроки(СтруктураОтбора);
		Если РольВСписке.Количество() > 0 Тогда
			РольВСписке[0].Включена = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры
